tutorials/lagrangian/reactingParcelFilmFoam/cylinder/Allrun.pre
#!/bin/sh
. $WM_PROJECT_DIR/bin/tools/RunFunctions

cp -rf 0.org 0
runApplication blockMesh

runApplication setSet -batch wallFilmRegion.setSet
mv log.setSet log.wallFilmRegion.setSet

runApplication extrudeToRegionMesh -overwrite
